Model: "RolloutPolicyNet"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Conv_5x5 (Conv2D)            (None, 15, 15, 64)        3264      
_________________________________________________________________
Conv1 (Conv2D)               (None, 15, 15, 64)        36928     
_________________________________________________________________
Conv_1x1 (Conv2D)            (None, 15, 15, 1)         65        
_________________________________________________________________
flatten_1 (Flatten)          (None, 225)               0         
_________________________________________________________________
softmax_1 (Softmax)          (None, 225)               0         
=================================================================
Total params: 40,257
Trainable params: 40,257
Non-trainable params: 0
_________________________________________________________________
model ready


train: (940350, 15, 15, 2) (940350,)
validation: (50000, 15, 15, 2) (50000,)
test: (50000, 15, 15, 2) (50000,)
data ready


Epoch 1/10
7346/7347 [============================>.] - ETA: 0s - loss: 2.4103 - accuracy: 0.3484
Epoch 00001: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_64_v2/cp-001.ckpt
7347/7347 [==============================] - 31s 4ms/step - loss: 2.4103 - accuracy: 0.3484 - val_loss: 2.3123 - val_accuracy: 0.3696
Epoch 2/10
7343/7347 [============================>.] - ETA: 0s - loss: 2.2797 - accuracy: 0.3788
Epoch 00002: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_64_v2/cp-002.ckpt
7347/7347 [==============================] - 31s 4ms/step - loss: 2.2797 - accuracy: 0.3788 - val_loss: 2.2689 - val_accuracy: 0.3813
Epoch 3/10
7339/7347 [============================>.] - ETA: 0s - loss: 2.2449 - accuracy: 0.3887
Epoch 00003: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_64_v2/cp-003.ckpt
7347/7347 [==============================] - 31s 4ms/step - loss: 2.2448 - accuracy: 0.3888 - val_loss: 2.2398 - val_accuracy: 0.3890
Epoch 4/10
7345/7347 [============================>.] - ETA: 0s - loss: 2.2235 - accuracy: 0.3943
Epoch 00004: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_64_v2/cp-004.ckpt
7347/7347 [==============================] - 30s 4ms/step - loss: 2.2235 - accuracy: 0.3943 - val_loss: 2.2240 - val_accuracy: 0.3937
Epoch 5/10
7344/7347 [============================>.] - ETA: 0s - loss: 2.2057 - accuracy: 0.3990
Epoch 00005: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_64_v2/cp-005.ckpt
7347/7347 [==============================] - 31s 4ms/step - loss: 2.2058 - accuracy: 0.3990 - val_loss: 2.2022 - val_accuracy: 0.4009
Epoch 6/10
7344/7347 [============================>.] - ETA: 0s - loss: 2.1923 - accuracy: 0.4029
Epoch 00006: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_64_v2/cp-006.ckpt
7347/7347 [==============================] - 31s 4ms/step - loss: 2.1923 - accuracy: 0.4029 - val_loss: 2.1894 - val_accuracy: 0.4049
Epoch 7/10
7339/7347 [============================>.] - ETA: 0s - loss: 2.1819 - accuracy: 0.4051
Epoch 00007: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_64_v2/cp-007.ckpt
7347/7347 [==============================] - 31s 4ms/step - loss: 2.1819 - accuracy: 0.4051 - val_loss: 2.1858 - val_accuracy: 0.4053
Epoch 8/10
7340/7347 [============================>.] - ETA: 0s - loss: 2.1731 - accuracy: 0.4078
Epoch 00008: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_64_v2/cp-008.ckpt
7347/7347 [==============================] - 31s 4ms/step - loss: 2.1732 - accuracy: 0.4078 - val_loss: 2.1731 - val_accuracy: 0.4089
Epoch 9/10
7339/7347 [============================>.] - ETA: 0s - loss: 2.1665 - accuracy: 0.4098
Epoch 00009: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_64_v2/cp-009.ckpt
7347/7347 [==============================] - 30s 4ms/step - loss: 2.1666 - accuracy: 0.4097 - val_loss: 2.1687 - val_accuracy: 0.4086
Epoch 10/10
7339/7347 [============================>.] - ETA: 0s - loss: 2.1605 - accuracy: 0.4114
Epoch 00010: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_64_v2/cp-010.ckpt
7347/7347 [==============================] - 31s 4ms/step - loss: 2.1605 - accuracy: 0.4114 - val_loss: 2.1622 - val_accuracy: 0.4126
1563/1563 - 3s - loss: 2.1721 - accuracy: 0.4084
2.1720712184906006 0.40838000178337097
train finished