Model: "RolloutPolicyNet"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Conv_5x5 (Conv2D)            (None, 15, 15, 64)        3264      
_________________________________________________________________
Conv1 (Conv2D)               (None, 15, 15, 32)        18464     
_________________________________________________________________
Conv2 (Conv2D)               (None, 15, 15, 32)        9248      
_________________________________________________________________
Conv_1x1 (Conv2D)            (None, 15, 15, 1)         33        
_________________________________________________________________
flatten_1 (Flatten)          (None, 225)               0         
_________________________________________________________________
softmax_1 (Softmax)          (None, 225)               0         
=================================================================
Total params: 31,009
Trainable params: 31,009
Non-trainable params: 0
_________________________________________________________________
model ready


train: (940350, 15, 15, 2) (940350,)
validation: (50000, 15, 15, 2) (50000,)
test: (50000, 15, 15, 2) (50000,)
data ready


Epoch 1/10
7347/7347 [==============================] - ETA: 0s - loss: 2.1505 - accuracy: 0.4140
Epoch 00001: saving model to ./gdrive/My Drive/colab_mount/model/rollout/64_32_32/cp-001.ckpt
7347/7347 [==============================] - 30s 4ms/step - loss: 2.1505 - accuracy: 0.4140 - val_loss: 2.0001 - val_accuracy: 0.4439
Epoch 2/10
7340/7347 [============================>.] - ETA: 0s - loss: 1.9618 - accuracy: 0.4536
Epoch 00002: saving model to ./gdrive/My Drive/colab_mount/model/rollout/64_32_32/cp-002.ckpt
7347/7347 [==============================] - 30s 4ms/step - loss: 1.9618 - accuracy: 0.4536 - val_loss: 1.9349 - val_accuracy: 0.4567
Epoch 3/10
7341/7347 [============================>.] - ETA: 0s - loss: 1.9101 - accuracy: 0.4653
Epoch 00003: saving model to ./gdrive/My Drive/colab_mount/model/rollout/64_32_32/cp-003.ckpt
7347/7347 [==============================] - 30s 4ms/step - loss: 1.9101 - accuracy: 0.4653 - val_loss: 1.9037 - val_accuracy: 0.4681
Epoch 4/10
7344/7347 [============================>.] - ETA: 0s - loss: 1.8809 - accuracy: 0.4715
Epoch 00004: saving model to ./gdrive/My Drive/colab_mount/model/rollout/64_32_32/cp-004.ckpt
7347/7347 [==============================] - 30s 4ms/step - loss: 1.8808 - accuracy: 0.4715 - val_loss: 1.8675 - val_accuracy: 0.4740
Epoch 5/10
7338/7347 [============================>.] - ETA: 0s - loss: 1.8606 - accuracy: 0.4761
Epoch 00005: saving model to ./gdrive/My Drive/colab_mount/model/rollout/64_32_32/cp-005.ckpt
7347/7347 [==============================] - 30s 4ms/step - loss: 1.8608 - accuracy: 0.4760 - val_loss: 1.8554 - val_accuracy: 0.4788
Epoch 6/10
7336/7347 [============================>.] - ETA: 0s - loss: 1.8463 - accuracy: 0.4789
Epoch 00006: saving model to ./gdrive/My Drive/colab_mount/model/rollout/64_32_32/cp-006.ckpt
7347/7347 [==============================] - 30s 4ms/step - loss: 1.8463 - accuracy: 0.4789 - val_loss: 1.8465 - val_accuracy: 0.4807
Epoch 7/10
7339/7347 [============================>.] - ETA: 0s - loss: 1.8349 - accuracy: 0.4813
Epoch 00007: saving model to ./gdrive/My Drive/colab_mount/model/rollout/64_32_32/cp-007.ckpt
7347/7347 [==============================] - 30s 4ms/step - loss: 1.8349 - accuracy: 0.4813 - val_loss: 1.8349 - val_accuracy: 0.4840
Epoch 8/10
7347/7347 [==============================] - ETA: 0s - loss: 1.8246 - accuracy: 0.4838
Epoch 00008: saving model to ./gdrive/My Drive/colab_mount/model/rollout/64_32_32/cp-008.ckpt
7347/7347 [==============================] - 30s 4ms/step - loss: 1.8246 - accuracy: 0.4838 - val_loss: 1.8270 - val_accuracy: 0.4836
Epoch 9/10
7345/7347 [============================>.] - ETA: 0s - loss: 1.8168 - accuracy: 0.4851
Epoch 00009: saving model to ./gdrive/My Drive/colab_mount/model/rollout/64_32_32/cp-009.ckpt
7347/7347 [==============================] - 30s 4ms/step - loss: 1.8168 - accuracy: 0.4851 - val_loss: 1.8195 - val_accuracy: 0.4853
Epoch 10/10
7336/7347 [============================>.] - ETA: 0s - loss: 1.8100 - accuracy: 0.4863
Epoch 00010: saving model to ./gdrive/My Drive/colab_mount/model/rollout/64_32_32/cp-010.ckpt
7347/7347 [==============================] - 30s 4ms/step - loss: 1.8100 - accuracy: 0.4863 - val_loss: 1.8162 - val_accuracy: 0.4869
1563/1563 - 3s - loss: 1.8311 - accuracy: 0.4813
1.8310884237289429 0.4812600016593933
train finished