Model: "RolloutPolicyNet"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Conv_5x5 (Conv2D)            (None, 15, 15, 128)       6528      
_________________________________________________________________
Conv1 (Conv2D)               (None, 15, 15, 32)        36896     
_________________________________________________________________
Conv_1x1 (Conv2D)            (None, 15, 15, 1)         33        
_________________________________________________________________
flatten (Flatten)            (None, 225)               0         
_________________________________________________________________
softmax (Softmax)            (None, 225)               0         
=================================================================
Total params: 43,457
Trainable params: 43,457
Non-trainable params: 0
_________________________________________________________________
model ready


train: (940350, 15, 15, 2) (940350,)
validation: (50000, 15, 15, 2) (50000,)
test: (50000, 15, 15, 2) (50000,)
data ready


Epoch 1/10
7347/7347 [==============================] - ETA: 0s - loss: 2.4034 - accuracy: 0.3502
Epoch 00001: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_32/cp-001.ckpt
7347/7347 [==============================] - 33s 4ms/step - loss: 2.4034 - accuracy: 0.3502 - val_loss: 2.3206 - val_accuracy: 0.3646
Epoch 2/10
7342/7347 [============================>.] - ETA: 0s - loss: 2.2682 - accuracy: 0.3799
Epoch 00002: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_32/cp-002.ckpt
7347/7347 [==============================] - 32s 4ms/step - loss: 2.2682 - accuracy: 0.3799 - val_loss: 2.2576 - val_accuracy: 0.3863
Epoch 3/10
7342/7347 [============================>.] - ETA: 0s - loss: 2.2366 - accuracy: 0.3889
Epoch 00003: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_32/cp-003.ckpt
7347/7347 [==============================] - 32s 4ms/step - loss: 2.2366 - accuracy: 0.3888 - val_loss: 2.2324 - val_accuracy: 0.3926
Epoch 4/10
7345/7347 [============================>.] - ETA: 0s - loss: 2.2180 - accuracy: 0.3943
Epoch 00004: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_32/cp-004.ckpt
7347/7347 [==============================] - 33s 4ms/step - loss: 2.2180 - accuracy: 0.3943 - val_loss: 2.2194 - val_accuracy: 0.3966
Epoch 5/10
7336/7347 [============================>.] - ETA: 0s - loss: 2.1999 - accuracy: 0.3996
Epoch 00005: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_32/cp-005.ckpt
7347/7347 [==============================] - 32s 4ms/step - loss: 2.1998 - accuracy: 0.3997 - val_loss: 2.1960 - val_accuracy: 0.4020
Epoch 6/10
7345/7347 [============================>.] - ETA: 0s - loss: 2.1847 - accuracy: 0.4042
Epoch 00006: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_32/cp-006.ckpt
7347/7347 [==============================] - 32s 4ms/step - loss: 2.1846 - accuracy: 0.4042 - val_loss: 2.1847 - val_accuracy: 0.4051
Epoch 7/10
7338/7347 [============================>.] - ETA: 0s - loss: 2.1728 - accuracy: 0.4076
Epoch 00007: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_32/cp-007.ckpt
7347/7347 [==============================] - 32s 4ms/step - loss: 2.1728 - accuracy: 0.4076 - val_loss: 2.1709 - val_accuracy: 0.4092
Epoch 8/10
7345/7347 [============================>.] - ETA: 0s - loss: 2.1637 - accuracy: 0.4099
Epoch 00008: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_32/cp-008.ckpt
7347/7347 [==============================] - 32s 4ms/step - loss: 2.1636 - accuracy: 0.4099 - val_loss: 2.1648 - val_accuracy: 0.4099
Epoch 9/10
7346/7347 [============================>.] - ETA: 0s - loss: 2.1564 - accuracy: 0.4118
Epoch 00009: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_32/cp-009.ckpt
7347/7347 [==============================] - 32s 4ms/step - loss: 2.1564 - accuracy: 0.4118 - val_loss: 2.1564 - val_accuracy: 0.4112
Epoch 10/10
7341/7347 [============================>.] - ETA: 0s - loss: 2.1508 - accuracy: 0.4138
Epoch 00010: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_32/cp-010.ckpt
7347/7347 [==============================] - 32s 4ms/step - loss: 2.1507 - accuracy: 0.4138 - val_loss: 2.1651 - val_accuracy: 0.4093
1563/1563 - 3s - loss: 2.1737 - accuracy: 0.4062
2.173651695251465 0.40615999698638916
train finished