Model: "RolloutPolicyNet"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Conv_5x5 (Conv2D)            (None, 15, 15, 64)        3264      
_________________________________________________________________
Conv1 (Conv2D)               (None, 15, 15, 32)        18464     
_________________________________________________________________
Conv_1x1 (Conv2D)            (None, 15, 15, 1)         33        
_________________________________________________________________
flatten_1 (Flatten)          (None, 225)               0         
_________________________________________________________________
softmax_1 (Softmax)          (None, 225)               0         
=================================================================
Total params: 21,761
Trainable params: 21,761
Non-trainable params: 0
_________________________________________________________________
model ready


train: (940350, 15, 15, 2) (940350,)
validation: (50000, 15, 15, 2) (50000,)
test: (50000, 15, 15, 2) (50000,)
data ready


Epoch 1/10
14693/14693 [==============================] - ETA: 0s - loss: 2.4139 - accuracy: 0.3466
Epoch 00001: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_32_v2/cp-001.ckpt
14693/14693 [==============================] - 57s 4ms/step - loss: 2.4139 - accuracy: 0.3466 - val_loss: 2.3274 - val_accuracy: 0.3670
Epoch 2/10
14685/14693 [============================>.] - ETA: 0s - loss: 2.3040 - accuracy: 0.3713
Epoch 00002: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_32_v2/cp-002.ckpt
14693/14693 [==============================] - 57s 4ms/step - loss: 2.3040 - accuracy: 0.3713 - val_loss: 2.2921 - val_accuracy: 0.3746
Epoch 3/10
14692/14693 [============================>.] - ETA: 0s - loss: 2.2731 - accuracy: 0.3803
Epoch 00003: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_32_v2/cp-003.ckpt
14693/14693 [==============================] - 57s 4ms/step - loss: 2.2731 - accuracy: 0.3802 - val_loss: 2.2639 - val_accuracy: 0.3826
Epoch 4/10
14687/14693 [============================>.] - ETA: 0s - loss: 2.2536 - accuracy: 0.3856
Epoch 00004: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_32_v2/cp-004.ckpt
14693/14693 [==============================] - 57s 4ms/step - loss: 2.2537 - accuracy: 0.3856 - val_loss: 2.2562 - val_accuracy: 0.3883
Epoch 5/10
14688/14693 [============================>.] - ETA: 0s - loss: 2.2396 - accuracy: 0.3890
Epoch 00005: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_32_v2/cp-005.ckpt
14693/14693 [==============================] - 56s 4ms/step - loss: 2.2396 - accuracy: 0.3890 - val_loss: 2.2422 - val_accuracy: 0.3893
Epoch 6/10
14690/14693 [============================>.] - ETA: 0s - loss: 2.2296 - accuracy: 0.3923
Epoch 00006: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_32_v2/cp-006.ckpt
14693/14693 [==============================] - 56s 4ms/step - loss: 2.2297 - accuracy: 0.3923 - val_loss: 2.2285 - val_accuracy: 0.3907
Epoch 7/10
14689/14693 [============================>.] - ETA: 0s - loss: 2.2222 - accuracy: 0.3940
Epoch 00007: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_32_v2/cp-007.ckpt
14693/14693 [==============================] - 57s 4ms/step - loss: 2.2222 - accuracy: 0.3940 - val_loss: 2.2252 - val_accuracy: 0.3943
Epoch 8/10
14693/14693 [==============================] - ETA: 0s - loss: 2.2168 - accuracy: 0.3960
Epoch 00008: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_32_v2/cp-008.ckpt
14693/14693 [==============================] - 57s 4ms/step - loss: 2.2168 - accuracy: 0.3960 - val_loss: 2.2210 - val_accuracy: 0.3947
Epoch 9/10
14685/14693 [============================>.] - ETA: 0s - loss: 2.2113 - accuracy: 0.3973
Epoch 00009: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_32_v2/cp-009.ckpt
14693/14693 [==============================] - 57s 4ms/step - loss: 2.2113 - accuracy: 0.3973 - val_loss: 2.2147 - val_accuracy: 0.3957
Epoch 10/10
14685/14693 [============================>.] - ETA: 0s - loss: 2.2068 - accuracy: 0.3981
Epoch 00010: saving model to ./gdrive/My Drive/colab_mount/model/rollout/rollout_64_32_v2/cp-010.ckpt
14693/14693 [==============================] - 55s 4ms/step - loss: 2.2069 - accuracy: 0.3981 - val_loss: 2.2148 - val_accuracy: 0.3951
1563/1563 - 4s - loss: 2.2140 - accuracy: 0.3952
2.214017152786255 0.39517998695373535
train finished