Model: "RolloutPolicyNet"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
Conv_5x5 (Conv2D)            (None, 15, 15, 128)       6528      
_________________________________________________________________
Conv1 (Conv2D)               (None, 15, 15, 64)        73792     
_________________________________________________________________
Conv_1x1 (Conv2D)            (None, 15, 15, 1)         65        
_________________________________________________________________
flatten_2 (Flatten)          (None, 225)               0         
_________________________________________________________________
softmax_2 (Softmax)          (None, 225)               0         
=================================================================
Total params: 80,385
Trainable params: 80,385
Non-trainable params: 0
_________________________________________________________________
model ready


train: (940350, 15, 15, 2) (940350,)
validation: (50000, 15, 15, 2) (50000,)
test: (50000, 15, 15, 2) (50000,)
data ready


Epoch 1/10
7347/7347 [==============================] - ETA: 0s - loss: 2.3784 - accuracy: 0.3560
Epoch 00001: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_64/cp-001.ckpt
7347/7347 [==============================] - 38s 5ms/step - loss: 2.3784 - accuracy: 0.3560 - val_loss: 2.2739 - val_accuracy: 0.3802
Epoch 2/10
7339/7347 [============================>.] - ETA: 0s - loss: 2.2422 - accuracy: 0.3878
Epoch 00002: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_64/cp-002.ckpt
7347/7347 [==============================] - 38s 5ms/step - loss: 2.2422 - accuracy: 0.3878 - val_loss: 2.2233 - val_accuracy: 0.3916
Epoch 3/10
7344/7347 [============================>.] - ETA: 0s - loss: 2.2046 - accuracy: 0.3988
Epoch 00003: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_64/cp-003.ckpt
7347/7347 [==============================] - 38s 5ms/step - loss: 2.2046 - accuracy: 0.3988 - val_loss: 2.1986 - val_accuracy: 0.4013
Epoch 4/10
7344/7347 [============================>.] - ETA: 0s - loss: 2.1753 - accuracy: 0.4063
Epoch 00004: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_64/cp-004.ckpt
7347/7347 [==============================] - 38s 5ms/step - loss: 2.1752 - accuracy: 0.4063 - val_loss: 2.1650 - val_accuracy: 0.4098
Epoch 5/10
7343/7347 [============================>.] - ETA: 0s - loss: 2.1518 - accuracy: 0.4124
Epoch 00005: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_64/cp-005.ckpt
7347/7347 [==============================] - 38s 5ms/step - loss: 2.1518 - accuracy: 0.4124 - val_loss: 2.1463 - val_accuracy: 0.4159
Epoch 6/10
7338/7347 [============================>.] - ETA: 0s - loss: 2.1342 - accuracy: 0.4175
Epoch 00006: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_64/cp-006.ckpt
7347/7347 [==============================] - 38s 5ms/step - loss: 2.1341 - accuracy: 0.4175 - val_loss: 2.1246 - val_accuracy: 0.4194
Epoch 7/10
7346/7347 [============================>.] - ETA: 0s - loss: 2.1209 - accuracy: 0.4208
Epoch 00007: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_64/cp-007.ckpt
7347/7347 [==============================] - 38s 5ms/step - loss: 2.1209 - accuracy: 0.4208 - val_loss: 2.1194 - val_accuracy: 0.4234
Epoch 8/10
7340/7347 [============================>.] - ETA: 0s - loss: 2.1108 - accuracy: 0.4231
Epoch 00008: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_64/cp-008.ckpt
7347/7347 [==============================] - 38s 5ms/step - loss: 2.1108 - accuracy: 0.4231 - val_loss: 2.1084 - val_accuracy: 0.4221
Epoch 9/10
7344/7347 [============================>.] - ETA: 0s - loss: 2.1030 - accuracy: 0.4252
Epoch 00009: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_64/cp-009.ckpt
7347/7347 [==============================] - 38s 5ms/step - loss: 2.1030 - accuracy: 0.4252 - val_loss: 2.1019 - val_accuracy: 0.4247
Epoch 10/10
7339/7347 [============================>.] - ETA: 0s - loss: 2.0964 - accuracy: 0.4268
Epoch 00010: saving model to ./gdrive/My Drive/colab_mount/model/rollout/128_64/cp-010.ckpt
7347/7347 [==============================] - 38s 5ms/step - loss: 2.0964 - accuracy: 0.4268 - val_loss: 2.0925 - val_accuracy: 0.4280
1563/1563 - 3s - loss: 2.1198 - accuracy: 0.4192
2.119849443435669 0.41920000314712524
train finished